balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1907.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBN" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBN0" edc:desc="" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN1" edc:desc="" edc:mask="0x1" edc:name="IOCBN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN2" edc:desc="" edc:mask="0x1" edc:name="IOCBN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN3" edc:desc="" edc:mask="0x1" edc:name="IOCBN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:desc="" edc:mask="0x1" edc:name="IOCBN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:desc="" edc:mask="0x1" edc:name="IOCBN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:desc="" edc:mask="0x1" edc:name="IOCBN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:desc="" edc:mask="0x1" edc:name="IOCBN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:mask="0xff" edc:name="IOCBN" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBF" edc:desc="Interrupt-On-Change Flag Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBF" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBF0" edc:desc="" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF1" edc:desc="" edc:mask="0x1" edc:name="IOCBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF2" edc:desc="" edc:mask="0x1" edc:name="IOCBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF3" edc:desc="" edc:mask="0x1" edc:name="IOCBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:desc="" edc:mask="0x1" edc:name="IOCBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:desc="" edc:mask="0x1" edc:name="IOCBF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:desc="" edc:mask="0x1" edc:name="IOCBF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:desc="" edc:mask="0x1" edc:name="IOCBF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBF" edc:desc="" edc:mask="0xff" edc:name="IOCBF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="9"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="14"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7F0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:SFRDef edc:access="nnc-nnnn" edc:cname="LCDCON" edc:desc="LCD Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0011" edc:name="LCDCON" edc:nzwidth="0x8" edc:por="000-0011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LMUX0" edc:desc="Commons Selection bits" edc:mask="0x1" edc:name="LMUX0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LMUX1" edc:desc="Commons Selection bits" edc:mask="0x1" edc:name="LMUX1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="Clock Source bits" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="Clock Source bits" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WERR" edc:desc="Write Failed Error bit" edc:mask="0x1" edc:name="WERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="LCD Display Sleep-Enabled bit" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDEN" edc:desc="LCD Module Enable bit" edc:mask="0x1" edc:name="LCDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LMUX" edc:desc="Commons Selection bits" edc:mask="0x3" edc:name="LMUX" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="Clock Source bits" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="LCDPS" edc:desc="LCD Phase Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDPS" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LP0" edc:desc="LCD Prescaler Selection bits" edc:mask="0x1" edc:name="LP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LP1" edc:desc="LCD Prescaler Selection bits" edc:mask="0x1" edc:name="LP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LP2" edc:desc="LCD Prescaler Selection bits" edc:mask="0x1" edc:name="LP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LP3" edc:desc="LCD Prescaler Selection bits" edc:mask="0x1" edc:name="LP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WA" edc:desc="Write Allow bit" edc:mask="0x1" edc:name="WA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDA" edc:desc="LCD Active bit" edc:mask="0x1" edc:name="LCDA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BIASMD" edc:desc="Bias Mode Selection bit" edc:mask="0x1" edc:name="BIASMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WFT" edc:desc="Waveform Type bit" edc:mask="0x1" edc:name="WFT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LP" edc:desc="LCD Prescaler Selection bits" edc:mask="0xf" edc:name="LP" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n-nnn-" edc:cname="LCDREF" edc:desc="LCD Reference Voltage Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-000-" edc:name="LCDREF" edc:nzwidth="8" edc:por="0-0-000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="VLCD1PE" edc:desc="VLCD1 pin enable bit" edc:mask="0x1" edc:name="VLCD1PE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VLCD2PE" edc:desc="VLCD2 pin enable bit" edc:mask="0x1" edc:name="VLCD2PE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VLCD3PE" edc:desc="VLCD3 pin enable bit" edc:mask="0x1" edc:name="VLCD3PE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LCDIRI" edc:desc="LCD Internal Reference Ladder Idle Enable bit" edc:mask="0x1" edc:name="LCDIRI" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LCDIRE" edc:desc="LCD Internal Reference Enable bit" edc:mask="0x1" edc:name="LCDIRE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="LCDCST" edc:desc="LCD Contrast Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="LCDCST" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDCST0" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDCST1" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDCST2" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LCDCST" edc:desc="LCD Contrast Control bits" edc:mask="0x7" edc:name="LCDCST" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="LCDRL" edc:desc="LCD Reference Voltage Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="LCDRL" edc:nzwidth="8" edc:por="0000-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LRLAT0" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAT1" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAT2" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP0" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x1" edc:name="LRLBP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP1" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x1" edc:name="LRLBP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAP0" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x1" edc:name="LRLAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAP1" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x1" edc:name="LRLAP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LRLAT" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x7" edc:name="LRLAT" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x3" edc:name="LRLBP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="LRLAP" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x3" edc:name="LRLAP" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE0" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SE0" edc:desc="" edc:mask="0x1" edc:name="SEG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE1" edc:desc="" edc:mask="0x1" edc:name="SEG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE2" edc:desc="" edc:mask="0x1" edc:name="SEG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE3" edc:desc="" edc:mask="0x1" edc:name="SEG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE4" edc:desc="" edc:mask="0x1" edc:name="SEG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE5" edc:desc="" edc:mask="0x1" edc:name="SEG5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE6" edc:desc="" edc:mask="0x1" edc:name="SEG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE7" edc:desc="" edc:mask="0x1" edc:name="SEG7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SE8" edc:desc="" edc:mask="0x1" edc:name="SEG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE9" edc:desc="" edc:mask="0x1" edc:name="SEG9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE10" edc:desc="" edc:mask="0x1" edc:name="SEG10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE11" edc:desc="" edc:mask="0x1" edc:name="SEG11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE12" edc:desc="" edc:mask="0x1" edc:name="SEG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE13" edc:desc="" edc:mask="0x1" edc:name="SEG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE14" edc:desc="" edc:mask="0x1" edc:name="SEG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE15" edc:desc="" edc:mask="0x1" edc:name="SEG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
