balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1907.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA10" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG8COM3" edc:desc="" edc:mask="0x1" edc:name="SEG8COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM3" edc:desc="" edc:mask="0x1" edc:name="SEG9COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM3" edc:desc="" edc:mask="0x1" edc:name="SEG10COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM3" edc:desc="" edc:mask="0x1" edc:name="SEG11COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM3" edc:desc="" edc:mask="0x1" edc:name="SEG12COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM3" edc:desc="" edc:mask="0x1" edc:name="SEG13COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM3" edc:desc="" edc:mask="0x1" edc:name="SEG14COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM3" edc:desc="" edc:mask="0x1" edc:name="SEG15COM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA11" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA11" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG16COM3" edc:desc="" edc:mask="0x1" edc:name="SEG16COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM3" edc:desc="" edc:mask="0x1" edc:name="SEG17COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM3" edc:desc="" edc:mask="0x1" edc:name="SEG18COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM3" edc:desc="" edc:mask="0x1" edc:name="SEG19COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM3" edc:desc="" edc:mask="0x1" edc:name="SEG20COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM3" edc:desc="" edc:mask="0x1" edc:name="SEG21COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM3" edc:desc="" edc:mask="0x1" edc:name="SEG22COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM3" edc:desc="" edc:mask="0x1" edc:name="SEG23COM3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="LCDDATA12" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="LCDDATA12" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24COM0" edc:desc="" edc:mask="0x1" edc:name="SEG24COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM0" edc:desc="" edc:mask="0x1" edc:name="SEG25COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM0" edc:desc="" edc:mask="0x1" edc:name="SEG26COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM0" edc:desc="" edc:mask="0x1" edc:name="SEG27COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM0" edc:desc="" edc:mask="0x1" edc:name="SEG28COM0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="LCDDATA15" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="LCDDATA15" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24COM1" edc:desc="" edc:mask="0x1" edc:name="SEG24COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM1" edc:desc="" edc:mask="0x1" edc:name="SEG25COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM1" edc:desc="" edc:mask="0x1" edc:name="SEG26COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM1" edc:desc="" edc:mask="0x1" edc:name="SEG27COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM1" edc:desc="" edc:mask="0x1" edc:name="SEG28COM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="LCDDATA18" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---xxuuu" edc:name="LCDDATA18" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24COM2" edc:desc="" edc:mask="0x1" edc:name="SEG24COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM2" edc:desc="" edc:mask="0x1" edc:name="SEG25COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM2" edc:desc="" edc:mask="0x1" edc:name="SEG26COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM2" edc:desc="" edc:mask="0x1" edc:name="SEG27COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM2" edc:desc="" edc:mask="0x1" edc:name="SEG28COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="LCDDATA21" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---xxuuu" edc:name="LCDDATA21" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24COM3" edc:desc="" edc:mask="0x1" edc:name="SEG24COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM3" edc:desc="" edc:mask="0x1" edc:name="SEG25COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM3" edc:desc="" edc:mask="0x1" edc:name="SEG26COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM3" edc:desc="" edc:mask="0x1" edc:name="SEG27COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM3" edc:desc="" edc:mask="0x1" edc:name="SEG28COM3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="88"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
